{"weightsManifest": [{"paths": ["group1-shard1of15.bin", "group1-shard2of15.bin", "group1-shard3of15.bin", "group1-shard4of15.bin", "group1-shard5of15.bin", "group1-shard6of15.bin", "group1-shard7of15.bin", "group1-shard8of15.bin", "group1-shard9of15.bin", "group1-shard10of15.bin", "group1-shard11of15.bin", "group1-shard12of15.bin", "group1-shard13of15.bin", "group1-shard14of15.bin", "group1-shard15of15.bin"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_10/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_10/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_10/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_10/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_11/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_11/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_11/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_11/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_12/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_12/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_12/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_12/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_13/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_13/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_13/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_13/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_14/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_14/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_14/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_14/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_3/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_4/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_5/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_6/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_7/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_7/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_7/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_7/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_8/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/gamma"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/beta"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "batch_normalization_9/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 3, 64], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_1/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv2d_10/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_10/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv2d_11/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_11/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv2d_12/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_12/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv2d_13/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_13/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_2/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 128], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_3/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 256], "name": "conv2d_5/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_5/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "conv2d_6/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_6/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_7/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 512], "name": "conv2d_8/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_8/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "conv2d_9/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv2d_9/bias"}, {"dtype": "float32", "shape": [512, 512], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [512, 10], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [10], "name": "dense_2/bias"}]}], "modelTopology": {"keras_version": "2.3.1", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 32, 32, 3], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "dtype": "float32", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "dtype": "float32", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "dtype": "float32", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "dtype": "float32", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "dtype": "float32", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_11", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "dtype": "float32", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_12", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_12"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "dtype": "float32", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_13", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_13"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_14"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "softmax", "trainable": true, "name": "activation_15"}}], "name": "sequential_1"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.6.0", "format": "layers-model"}